togglebit/CANFDuino/samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# CANFDUINO
CANFDuino.name=CANFDuino
CANFDuino.vid.0=0x0403
CANFDuino.pid.0=0x6015
CANFDuino.vid.1=0x10C4
CANFDuino.pid.1=0xEA60
CANFDuino.build.usb_manufacturer="Togglebit"
CANFDuino.build.board=SAMD_ZERO
CANFDuino.build.core=arduino
CANFDuino.build.variant=CANFDuino
CANFDuino.build.variant_system_lib=
CANFDuino.build.vid=0x16D0
CANFDuino.upload.protocol=sam-ba
CANFDuino.bootloader.tool=arduino:openocd
CANFDuino.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
CANFDuino.build.buildconfig=CONFIG_H_DISABLED
CANFDuino.build.clockconfig=CLOCKCONFIG_INTERNAL
CANFDuino.build.timerconfig=TIMER_732Hz
CANFDuino.upload.maximum_size=253952
CANFDuino.upload.maximum_ram_size = 32768
CANFDuino.upload.native_usb=false
CANFDuino.build.mcu=cortex-m0plus
CANFDuino.build.mathlib=arm_cortexM0l_math
CANFDuino.build.f_cpu=48000000L
CANFDuino.build.usb_product="CANFDuino"
CANFDuino.build.extra_flags=-D__SAMC21G18A__ -DARM_MATH_CM0PLUS
CANFDuino.build.ldscript=flash_256KB.ld
CANFDuino.build.openocdscript=openocd_scripts/SAMC21G18A.cfg
CANFDuino.build.bootloader_size=__8KB_BOOTLOADER__
CANFDuino.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
CANFDuino.upload.tool=CANFDuino:bossac
CANFDuino.upload.use_1200bps_touch=true
CANFDuino.upload.wait_for_upload_port=false
CANFDuino.build.serialcom_uart=THREE_UART
CANFDuino.build.serialcom_wire=ONE_WIRE
CANFDuino.build.serialcom_spi=ONE_SPI
CANFDuino.build.usbcom=USB_DISABLED
CANFDuino.build.pid=0x0856


# CANFDUINO
CANFDuino17A.name=CANFDuino17A
CANFDuino17A.vid.0=0x0403
CANFDuino17A.pid.0=0x6015
CANFDuino17A.vid.1=0x10C4
CANFDuino17A.pid.1=0xEA60
CANFDuino17A.build.usb_manufacturer="Togglebit"
CANFDuino17A.build.board=SAMD_ZERO
CANFDuino17A.build.core=arduino
CANFDuino17A.build.variant=CANFDuino
CANFDuino17A.build.variant_system_lib=
CANFDuino17A.build.vid=0x16D0
CANFDuino17A.upload.protocol=sam-ba
CANFDuino17A.bootloader.tool=arduino:openocd
CANFDuino17A.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
CANFDuino17A.build.buildconfig=CONFIG_H_DISABLED
CANFDuino17A.build.clockconfig=CLOCKCONFIG_INTERNAL
CANFDuino17A.build.timerconfig=TIMER_732Hz
CANFDuino17A.upload.maximum_size=122880
CANFDuino17A.upload.maximum_ram_size = 16384
CANFDuino17A.upload.native_usb=false
CANFDuino17A.build.mcu=cortex-m0plus
CANFDuino17A.build.mathlib=arm_cortexM0l_math
CANFDuino17A.build.f_cpu=48000000L
CANFDuino17A.build.usb_product="CANFDuino17A"
CANFDuino17A.build.extra_flags=-D__SAMC21G17A__ -DARM_MATH_CM0PLUS
CANFDuino17A.build.ldscript=flash_128KB.ld
CANFDuino17A.build.openocdscript=openocd_scripts/SAMC21G17A.cfg
CANFDuino17A.build.bootloader_size=__8KB_BOOTLOADER__
CANFDuino17A.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
CANFDuino17A.upload.tool=CANFDuino:bossac
CANFDuino17A.upload.use_1200bps_touch=true
CANFDuino17A.upload.wait_for_upload_port=false
CANFDuino17A.build.serialcom_uart=THREE_UART
CANFDuino17A.build.serialcom_wire=ONE_WIRE
CANFDuino17A.build.serialcom_spi=ONE_SPI
CANFDuino17A.build.usbcom=USB_DISABLED
CANFDuino17A.build.pid=0x0856

# CANFDUINO
CANFDuino3SPI.name=CANFDuino3SPI
CANFDuino3SPI.vid.0=0x0403
CANFDuino3SPI.pid.0=0x6015
CANFDuino3SPI.vid.1=0x10C4
CANFDuino3SPI.pid.1=0xEA60
CANFDuino3SPI.build.usb_manufacturer="Togglebit"
CANFDuino3SPI.build.board=SAMD_ZERO
CANFDuino3SPI.build.core=arduino
CANFDuino3SPI.build.variant=CANFDuino
CANFDuino3SPI.build.variant_system_lib=
CANFDuino3SPI.build.vid=0x16D0
CANFDuino3SPI.upload.protocol=sam-ba
CANFDuino3SPI.bootloader.tool=arduino:openocd
CANFDuino3SPI.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
CANFDuino3SPI.build.buildconfig=CONFIG_H_DISABLED
CANFDuino3SPI.build.clockconfig=CLOCKCONFIG_INTERNAL
CANFDuino3SPI.build.timerconfig=TIMER_732Hz
CANFDuino3SPI.upload.maximum_size=122880
CANFDuino3SPI.upload.maximum_ram_size = 16384
CANFDuino3SPI.upload.native_usb=false
CANFDuino3SPI.build.mcu=cortex-m0plus
CANFDuino3SPI.build.mathlib=arm_cortexM0l_math
CANFDuino3SPI.build.f_cpu=48000000L
CANFDuino3SPI.build.usb_product="CANFDuino3SPI"
CANFDuino3SPI.build.extra_flags=-D__SAMC21G18A__ -DARM_MATH_CM0PLUS
CANFDuino3SPI.build.ldscript=flash_128KB.ld
CANFDuino3SPI.build.openocdscript=openocd_scripts/SAMC21G17A.cfg
CANFDuino3SPI.build.bootloader_size=__8KB_BOOTLOADER__
CANFDuino3SPI.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
CANFDuino3SPI.upload.tool=CANFDuino:bossac
CANFDuino3SPI.upload.use_1200bps_touch=true
CANFDuino3SPI.upload.wait_for_upload_port=false
CANFDuino3SPI.build.serialcom_uart=TWO_UART
CANFDuino3SPI.build.serialcom_wire=ONE_WIRE
CANFDuino3SPI.build.serialcom_spi=THREE_SPI
CANFDuino3SPI.build.usbcom=USB_DISABLED
CANFDuino3SPI.build.pid=0x0856

# CANFDUINO
CANFDuinoDIN.name=CANFDuinoDIN
CANFDuinoDIN.vid.0=0x0403
CANFDuinoDIN.pid.0=0x6015
CANFDuinoDIN.vid.1=0x10C4
CANFDuinoDIN.pid.1=0xEA60
CANFDuinoDIN.build.usb_manufacturer="Togglebit"
CANFDuinoDIN.build.board=SAMD_ZERO
CANFDuinoDIN.build.core=arduino
CANFDuinoDIN.build.variant=CANFDuino
CANFDuinoDIN.build.variant_system_lib=
CANFDuinoDIN.build.vid=0x16D0
CANFDuinoDIN.upload.protocol=sam-ba
CANFDuinoDIN.bootloader.tool=arduino:openocd
CANFDuinoDIN.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
CANFDuinoDIN.build.buildconfig=CONFIG_H_DISABLED
CANFDuinoDIN.build.clockconfig=CLOCKCONFIG_INTERNAL
CANFDuinoDIN.build.timerconfig=TIMER_732Hz
CANFDuinoDIN.upload.maximum_size=122880
CANFDuinoDIN.upload.maximum_ram_size = 16384
CANFDuinoDIN.upload.native_usb=false
CANFDuinoDIN.build.mcu=cortex-m0plus
CANFDuinoDIN.build.mathlib=arm_cortexM0l_math
CANFDuinoDIN.build.f_cpu=48000000L
CANFDuinoDIN.build.usb_product="CANFDuinoDIN"
CANFDuinoDIN.build.extra_flags=-D__SAMC21G18A__ -DCANFDUINO_DIN -DARM_MATH_CM0PLUS
CANFDuinoDIN.build.ldscript=flash_128KB.ld
CANFDuinoDIN.build.openocdscript=openocd_scripts/SAMC21G17A.cfg
CANFDuinoDIN.build.bootloader_size=__8KB_BOOTLOADER__
CANFDuinoDIN.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
CANFDuinoDIN.upload.tool=CANFDuino:bossac
CANFDuinoDIN.upload.use_1200bps_touch=true
CANFDuinoDIN.upload.wait_for_upload_port=false
CANFDuinoDIN.build.serialcom_uart=THREE_UART
CANFDuinoDIN.build.serialcom_wire=ONE_WIRE
CANFDuinoDIN.build.serialcom_spi=ONE_SPI
CANFDuinoDIN.build.usbcom=USB_DISABLED
CANFDuinoDIN.build.pid=0x0856